#Include "Protheus.Ch"
#Include "TopConn.ch"

/*
==============================================================================
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
||+---------------------+-------------------------------+------------------+||
||| Programa: SF1100E   | Autor: Celso Ferrone Martins  | Data: 29/10/2014 |||
||+-----------+---------+-------------------------------+------------------+||
||| Descricao | PE executado no estorno/exclusão da NF de entrada          |||
||+-----------+------------------------------------------------------------+||
||| Alteracao |                                                            |||
||+-----------+------------------------------------------------------------+||
||| Uso       |                                                            |||
||+-----------+------------------------------------------------------------+||
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
==============================================================================
*/
User Function SF1100E()

Processa({|| fZ04Excl()},"Gravando Ajustes...")
Processa({|| fCteExcl()},"Gravando Ajustes...")

Return()

/*
==============================================================================
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
||+---------------------+-------------------------------+------------------+||
||| Programa: fCteExcl  | Autor: Celso Ferrone Martins  | Data: 29/10/2014 |||
||+-----------+---------+-------------------------------+------------------+||
||| Descricao | Exclui Flag das CTE nas Nfs de Saida                       |||
||+-----------+------------------------------------------------------------+||
||| Alteracao |                                                            |||
||+-----------+------------------------------------------------------------+||
||| Uso       |                                                            |||
||+-----------+------------------------------------------------------------+||
||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
==============================================================================
*/
Static Function fCteExcl()

DbSelectArea("Z11") ; DbSetOrder(1)
Z11->(DbSeek(xFilial("Z11")+SF1->(F1_DOC+F1_SERIE+F1_FORNECE+F1_LOJA)))
While !Z11->(Eof()) .And. xFilial("Z11")+SF1->(F1_DOC+F1_SERIE+F1_FORNECE+F1_LOJA) == Z11->(Z11_FILIAL+Z11_DOC+Z11_SERIE+Z11_CLIFOR+Z11_LOJA)
	RecLock("Z11",.F.)
	Z11->(DbDelete())
	MsUnLock()
	Z11->(DbSkip())
EndDo

Return()

/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºPrograma  ³fZ04Excl  ºAutor  ³Nelson Junior       º Data ³  04/06/14   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³                                                            º±±
±±º          ³                                                            º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/

Static Function fZ04Excl()

If AllTrim(SF1->F1_TIPO) == "D"
	//
	DbSelectArea("Z04")
	Z04->(DbSetOrder(3))
	//
	While Z04->(DbSeek(xFilial("Z04")+SF1->F1_DOC+SF1->F1_SERIE+SF1->F1_FORNECE+SF1->F1_LOJA))
		//
		RecLock("Z04", .F.)
			Z04->(DbDelete())
		Z04->(MsUnlock())
		//
		Z04->(DbSkip())
	EndDo
	//
	Z04->(DbSetOrder(1))
	//
EndIf

Return()